{
    "input": "Who took notes last week? Let me see in Slack. That would be Caitlin. I think Caitlin is gone now. Yeah, yesterday was her last day before internship. So would anyone like to volunteer to take notes? Okay. Let's go with Caitlin. Okey-dokey. I just randomly picked somebody. All right. So first off, I know some of you all, this is your last day before your internship. So farewell for the meantime anyway. What's going on? I'll admit him. It's loading for some reason. I don't know why they don't want Vicky in the meeting. Tahir is our doorman. I don't get tips, man. That's crazy. You can make a feature. All right. He's in. There he is. All right. So like I was saying, you're leaving for your internships. When you clock out today, make sure you submit your time in workday. If you're leaving for the summer, because otherwise I'm going to bug you next week to submit it anyway. So you might as well do it today. Let's see. As far as calendar stuff goes, and with your internships, if for some reason you're not going to come back, like you decide that you're just not going to come back, please let me know as soon as you can. We definitely want to have all of you all back. But yeah, just let us know if those plans change. Because we won't have time to prepare and hire replacements and things like that. Another thing, I want everybody today, if you're working here over the summer, go into the office, actually, regardless, go into the office presence spreadsheet and update it to be what your schedule is. So if you're not working here over the summer or you're working fully remote over the summer for some reason, then you can, I don't know if we approved anybody for that, but if we did, then go in and remove all of the trues from all of your rows. That'll just help us make sure that we have plenty of coverage for the office. Any other announcements that I'm forgetting? Just a reminder about the name tags and the t-shirt sizes. Yes. That spreadsheet, I'm not sure. I haven't actually checked it to see. We've got 10 people that have put in for name tags and 13 people who put in for shirts. I'm pretty sure everyone who's here has put that in. But if you haven't, please go in and put that in that spreadsheet because we'll use that as our list of who to get polo shirts and name tags for. If your name is not in there, we're not getting you one. Then name tags, obviously, those are very important for when we do presentations and things like that, whenever we do in-person presentations anyway. Then the shirts, it's just very nice that now we have the opportunity to get them because it's been years since we were able to get shirts for new people. I always felt a little bit bad wearing mine because it was something that not everyone could wear because not everyone got them. Looking at the calendar here. Time sheets are due next week before when you clock out on Thursday of next week. Actually, I'm going to need those early. I'm going to send out a reminder Wednesday morning for everyone to submit their time. As early as they can because I'm going to be on leave on Friday and I want to be able to get all of those processed before I clock out on Thursday. I'm also going to be at the AWS Public Sector Conference on Thursday. I need to have everything in. If I can't get to it, Francisco has the ability to, but I want to get as much of it done before Francisco has to deal with it as possible. Any other news or updates or anything before we get to the project updates? I see something in the chat. Oh, yeah. Thanks. Yeah. All right. I guess I'll start with the LTI 1.3 thing just because it's in the chat already. Otherwise, I'll forget to mention it. I do want to say that the deadline extension, the new deadline is to be determined because it's going to be up to us when we turn off the OMBED endpoint. Are the LMS admins aware of the change in stuff? Yes. I told them about it. But that's a good reminder. I'll talk to them about it again, make sure they completely understand what the score is here. Cool. Well, at least for me, I've basically taken up all of Danny's time explaining to him all of the stuff that I've learned about how to deploy stuff to AWS and all of the insane mazes you have to go through. We've been going through that this week and we're pretty far along. We've got a document that's pretty lengthy at this point that describes everything I know so far. We'll have to go through that and clean it up a little bit, but it does exist. Nice. Very excited about that. Syntax highlighter is working on, it's been deployed. The application still needs a little tweaking, but it's on AWS, at least for the dev version. Nice. Thank you for all the work that you all put into that. I know it's been days of being on calls. Yeah, it's been interesting. I've been working on this for a couple of weeks now. All right. Let's go to course development and press books. Is Kyla here? Yeah, I'm here. Not a whole lot with course development this week, but in two weeks on June 16th, we are doing the IDL 6543, which for those who might not be aware is the process that professors at UCF go through to get certification to teach fully online. We are doing a presentation on LTIs and like Obojobo Materia, and I'm doing one with Amy on who the tech ranges are and our accessibility and course development. If there's a tech ranger who wants to get some more presentation experience, let me know sometime next week. It's really simple. We have all the sides. You just have to memorize it and then it's fully online. It's on Zoom, so let me know. For Pressbooks, the PDF course we are doing, or PDF conversion from Pressbook is almost done. Danny M was helping me with the QR codes for that, so that's finally wrapping up. Then Jayden is working on the other Pressbook that was web courses to Pressbooks conversion. She's doing really good with that. Those are the only ones that are the most important right now. Let's talk about Materia. I've been working on just polish on the React branch. I'm hoping to get a new build deployed to QA. Kay wrapped up the notification conversion, so I'm hoping to get that tested out today. Simon's working on dark mode for the React branch. Jayden, when she's not doing OER stuff, is working on the adaptive question bank widget that we're picking up from Brandon. Dee was helping with Materia for a day and then went on internship. That's pretty much it. All right, Obu Drobo. Viggy has wrapped up his work on the collections management quality of life improvements. I've been trying to finalize, review, and merge in pull requests for the upcoming release. I'm hoping to get it on QA next week. Sweet. All right. WordPress, I've been working on getting the new teach site set up on QA. I basically got everything in place. I just need to request the teach.qa.cdl.ucf.edu domain. I need to request the database to be created on QA. I guess I should go ahead and request that to be created on production as well. Yeah, that's it for that. Dana and I worked together to get the CDL website theme updated based off of Tahir's changes for a ticket. Any other things that you can think of, Danny? I think that's about it. The only other thing would be the website that's coming down, but that's in the future, right? It's not like... Yeah, that's going to be on the 12th. Yeah, that's when the MSI site is going down. Yeah. So let's go to captioning. Orders continue to come in and being processed. CaptionHub and Able are taking small steps forward but are still being worked on. I think Evan has some updates that he has been working on. Yeah, I've been working on getting Able Player set up with Nginx. It's all running now, working in the Docker container. I just have to update the documentation for local development. All right. Carlos, are there specific pull requests that you're reviewing right now or specific features that you all are working on that Evan didn't talk about? Not at the moment, no. Okay. Let's see. Quality badges. Colin finished reviewing, which I guess I'm speaking for him even though he's here, but he finished reviewing quality badges and I was working on getting the CI CD stuff set up for quality badges on GitHub because it was on GitLab and made sure all that was reconciled, archived the old GitLab repo. Then I just need to deploy the quality badges. I have it merged into the develop branch right now, so I'm going to put that on QA. I don't have a time for that, but I might have put it on my schedule here somewhere. That's right. Yeah, Monday morning, the morning of the fifth. I'm going to put that on QA and see if it works. It probably won't, but we'll see. I'll probably do something wrong is what I mean to say. It's just because I haven't deployed a big update to quality badges in a long time. Let's go to soul patch. Wait, no, I skipped. You do it. So we do have the you do it community meeting today this afternoon at three, so if anyone's interested in joining that, you're welcome to. It's usually pretty short. We just have a few people that join and we kind of talk about what's going on with you do it at their various institutions. And Tahir, did you have an update? Yeah. So I've been working on basically porting the scanning process to a worker process essentially, and the progress on that is pretty good so far. The message like the message format has been created. The message handler format has been created as well. I'm having some issues with dependency injection with symphony and like one thing that really sucks about symphony is that like anytime you change anything like in either the services or the controllers or even the message handlers, it'll like it has an extensive amount of cash. And so basically any change that you make to the program, you're going to have to clear the cash and then restart the then basically restart the application, which is pretty frustrating but slows progress a bit. But so far it's been pretty good. I managed to get three out of the six dependencies ported over. The rest are using like some kind of session service that's just not working with the message handler. I don't know why. So I'll have to look into that further. But yeah, it's looking pretty good. All right. Soul patch. Pretty slow on soul patch since all three of us were on other stuff for a while. But Caitlin managed to have some time for the PRs either yesterday or the day before and found some issues with my PRs. So I'll fix them and submit a fix and hopefully that'll do it. All right. We already talked about LTI 1.3 conversion. Let's go to UCF here. You had a fun morning. Yeah. So let's start with what went well. Kobe made a quick graph to illustrate how present tardy and absence and how over time those values change. So that's awesome. He's also helping with more testing and checking the front end. I'm not missing anything, right, Kobe? Yeah, you got it. You got it. Cool. In my case, on Tuesday, on Wednesday and Thursday, I was also with the LTI team, seeing how the deploy of AWS is done, so I can also apply it to UCF here. And today we woke up to an email saying that UCF here, the app, certain things don't comply, so we needed to update those values really fast for the Android store. So thankfully, at least for now, it seems to be just a policy. We needed to set a direct route or direct URL to the policies of UCF. So privacy policy. Yeah, the privacy policy. So that was set up. I talked to Joey Radish for a while, going over how they have their system set up when it comes to the relationship between UCF and the government. Not a fun conversation, but I cleared up a couple of things. And now I'm going to keep reading to see if I'm missing anything about UCF here, so the app stays in the Play Store. Yeah, it was like you have until June 9th to fix this, right? Yeah. Yeah, oh, the other good thing, the phone came in. I was able to, the APK that I built, I was able to install it on the phone that users say it doesn't work. So that's a good thing. It works, the APK there. So if it doesn't work on them, I'm going to be upset. Well, yeah, so at least the APK works, so that's good. And then we just need to make sure that the store isn't going to block it from new phones like that. Yeah, everything's good. OK, so yeah, if anyone is curious what a Galaxy S23, do we get the Ultra or just the normal? Normal. Normal. If anyone's curious what one of those is like, we have one now. It just can't leave the room. And I make sure it goes back in that cabinet every night. Yeah, that's the phone I just got. Oh, nice. The Ultra. Oh, you got the fancy. Yeah, I got like a, if I traded my old phone, I got $600 credit. So it was basically like $500. Holy crap. Yeah, it's a good deal right now. Yeah, that's the competition. Apple, I guess Apple. Yeah, you probably couldn't have sold your old phone for $600 or for $500 or whatever. Oh no, for sure. Definitely not. It was the S21. So it was already two back. Or not even, it was the S20. It was the Note 20 Ultra is what it was. So it was before they stopped using Note and they were like, yeah, we'll take this for $600. Nice. OK. Yeah, yeah, thanks Emmanuel. Any other updates for anything that I might have missed? This isn't really a project update. It was more so of an announcement, but would you guys be down for like a pickup soccer game? Because like I talked about it in the chat and I talked about it with Evan and he seemed down. So you guys want to say? I would definitely be down. Yeah. I'd be down. I know. Like the tennis one. I was thinking maybe more like Tech Rangers. Like our department, that would be pretty difficult to organize. But yeah, I meant like in that sense, like we meet up like after after work sometimes. Oh, definitely after work. Yeah. Yeah. I don't know if I'd like want to come back to work after team building soccer. That's the most productive. So I got my build the team during it, but you the stinky people coming back into the room might break the team. There is a shower. Yeah, that would be a real team building activity. One shower. There's one shower. Anyway. We could send an announcement or whatever on LSNL. See who joins or see who wants to join. We could make something happen. I'm kind of interested, but I would I would need to like go play a season in a kid's soccer league or something just to learn. I guaranteed like I honestly I think Viggy and I are the only people that play regularly and like he's seen me play and I've seen him play like you can hold your own. You know, yeah. Yeah. Put that in the in the I know you already asked about it in slack, but but yeah, please follow up with to hear if you're interested in that. Any other things? Oh, I guess I should say for the portfolio stuff, because that's that's kind of my ongoing project. I'm putting together a kind of a dashboard of. Of how that whole thing looks and some just some numbers around it, so yeah, that's that's kind of what I'm working on with that. And then it's obviously it's always a constant struggle, making sure that it's up to date and that and if I discover any more projects, I'm adding them. So that's that's my deal. So any other things for move on to a pumpkin question that we don't have a pumpkin for? Ask Reddit. You know, we we should do like a safe for work, ask Reddit bot. Yeah, you're gonna get a lot of garbage that way. I think I had a document. I have a actually have a good ask Reddit related question for the pumpkin today. OK, since everyone knows that Reddit's killing third party apps on July 1st. What's a good Reddit alternative? Because fuck Reddit if they kill third party apps, there's no way I'm using it after that. There is none. Yeah, they're making their API paid for real soon. It's not too great. Oh yeah, and it's like prohibitively expensive intentionally so that they can force everyone onto the first party app, which is terrible. Yeah, it's funny. Like I first started using Reddit when they uploaded like a lot of people. So it'd be hilarious if everyone ended up going back to date. I mean, I want to say it's half as useful, but Quora sometimes comes in clutch. Quora exists only for trolls. That's it. Reddit kind of does, but at least there's some valuable stuff on there. I've never seen a valuable thing on Quora ever. Are they? Not even a meme? Sure, I mean it's provided me entertainment, but never real value. My concern is a lot of like niche communities on Reddit are just going to end up going to Discord because Discord is already kind of becoming the de facto for that. And I'll be honest, I fucking hate that trend because finding it like finding discords for anything is annoying. Being part of a Discord community is really annoying sometimes because they all have different rules and all the information there is really ephemeral because it's just a chat log. Yeah, not a fan. And only that, your Discord, it's all what I say, cluttered? Yeah. For what it's worth, Discord is building a like forum like feature. So maybe that'll go somewhere, but we'll see. I don't have high hopes for it. Kind of feels like the internet's like fashion, right? Like ideas die and then they eventually become resurrected and rebuilt. Yeah, we'll just put up another like PHP BB forum. It'll be a good time. I used to manage PHP BB forums. Same. Yeah, let's do it. We blued it. Instead of Reddit, blued it. Yeah, I mean, Reddit is the joke on like that you've already read it. So it's like you need to find another pun. I mean, I wouldn't pass I want to put it past someone to make a Reddit to if like if this guarantee such things exist, they're just not popular. Yeah, but I'm saying like once that's done, sum it up. Mastodon? Yeah, they're like open source communities. Like you can run your own instance of Mastodon or something like that. Yeah, the whole like federated which I think is cool, but none of them have sort of hit critical mass where everyone's like, okay, I gotta go here. No, no. There's also a blue sky or blue ski. That's just Twitter too. Yeah, I hear a lot of talk about that, but I know it's invite only and I haven't even bothered to look. It kind of feels like Google Plus, like, you know, if they keep it invite only professionally, they're going to lose their window and everyone's going to be like, I don't care about that. I was going to add that the Discord forms feature, it's pretty unintuitive. Like you can have a form post be made and if it's a particularly active Discord, like you could just have posts from like hundreds of days ago that are still active, just trumpet in terms of where it appears. And so no one will ever see your new form post pretty much. I mean, all the old BB forums have the same problem. Everybody bumping stuff. Well, another huge problem with Discord is that I can't Google search it. So I won't be able to say, you know, best hotels in Atlanta Discord in Google. And, you know, I won't get anything if I do that. Yeah, really weird that's going to be like a big problem for sort of like web archiving slash history slash, you know, like knowledge dissemination. It's like all this information is just sequestered in Discord. Not only are they, you know, the beginning and the end of the authority of retaining that information, but it makes it really hard to get from the outside. Yeah, yeah, it's like when a restaurant only has a Facebook page, it's like that level of frustration for me when somebody only has a Discord. Yeah, yeah. It's just like Maguire's. Like what? Maguire's, the Irish pub I worked at, they only have a Facebook page pretty much. I had this idea. I think, yeah, Keegan and I had this idea years ago to do like just like pro bono web sites for small businesses that can't afford a website and only have a Facebook page. But I guess there's actually already companies that do that, like already charities that will do that. Because it's just I want my favorite restaurant to have a website that's usable and I don't want to have to go through Postmates or, you know, whatever the food delivery service is that scraped all the data and is taking money off the top. I know it may not be particularly relevant, but I was planning on taking a picture of myself with the peanut butter bacon burger, but I just never got around to going. So sorry, guys. Next time. I know Tejera was particularly waiting on that. Dude, I was like, I couldn't I was counting the days, man. Are you going are you going back to Orlando next week? It's either tomorrow or the next day because my internship starts Monday. So go today. I have a last ditch board game night tonight, so I'm not. Do it on the fire or just like do a door dash or something. I'm not door dashing Meguiar's. Why not? They're way too expensive already. I don't know. Peanut butter bacon burger door dash. Like that sounds like a disaster. All the oils are going to like separate and it's just it's going to be gross. Yeah. You open it up. It's like it looks like a baby diaper or something. Jesus Christ. I'll consider it. How about that to hear? Please. Not a good idea, but I'll consider it. OK, what time do you. OK, so then what time would you come back tomorrow? Uh. I don't know, maybe I'll start driving around 10 10 a.m. or so, because I don't want to drive a butter bacon burger for breakfast as well on a road trip. Yeah, right before a seven hour drive. Yeah, that's right. I think it's a fantastic idea. Then it's your stomach like a little have a story afterwards. That's cool. 100%. 100%. Or you should get me one, man. Yeah, I'll just I'll just make sure to leave it at the office to sit over the weekend, you know, or you can drop it off at my house, you know, and that's true, too. But I don't think you'd want to eat a burger that's been sitting out for seven hours. You don't know me. Well, on that note, anything else to add before we break? All right. Not really an announcement or anything, but I wanted to wish everyone going on internships a good internship and hope you learn a lot. Take care. I'll see you back here. Yeah, I hope you learn a lot too, Daniel. I will try. Let's let's everybody learn a lot this summer. Let's do it. All right. Have a good weekend, y'all. Okay. You'll have a great one. Take care, guys.",
    "output": ":cat-on-keyboard:TR WEEKLY: :cat-on-keyboard:\n:airhorn: ANNOUNCEMENTS:airhorn:\n- Farewell Interns. Remember to submit your time in Workday after clocking out today. If you aren’t returning, let Jacob know\n- Update Office Presence Worksheet if you are leaving for an internship or working remote.\n- Submit your T-Shirt Sizes and Nametags!\n- Submit time as early as they can next week (at the very least, before next Thursday)\n- Pickup soccer game\n- Jacob working on a portfolio dashboard\n:female_vampire:Vampire:\n- temporary on hold.\n:closed_book:Course Dev & Pressbooks:\n- Presenting in two weeks, on June 16, for IDL 6543 (Instructor online teaching certification course). If a Techranger wants to help present, let Kylee know!\n- PDF conversion is almost done. Danny m helped with QR code conversion.\n- Jadan working on AMD textbook\n:materia: Materia: :peario:\n- React branch home stretch\n- Notification UI pushed\n- Simon working on dark mode\n:obojobo:OBOJOBO:\n- Viggie wrapped up quality of life stuff on dashboard\n- Looking into upgrading obo to LTI 1.3\n- Brandon working on merging pull requests for release to QA next week\n:spider_web: WORDPRESS:\n- Retiring MSI site on the 12th of June\n- Working on getting the new teach site up. Just need to request the new domain and creation of the database on QA and prod\n- Danny m and Jacob worked on getting the CDL theme updated based on Taher’s changes for a ticket\n:apcfrog: Captioning :frog::\n- Carlos is working on orders as they come in\n:arrow_forward: AblePlayer:\n- Carlos is still working on Able\n- Evan has been working on getting nginx working and the documentation for local development\n:quality:Quality Badges:\n- Collin reviewing quality badges\n- Jacob CI/CD setup on Github (previously on GitLab). Deploying the Quality Badges from the dev branch to QA on Monday\n:udoit:UDOIT:\n- UDOIT community meeting at 3PM today. Feel free to join!\n- Taher porting scanning process to a worker process is going well. Message format has been created, message handler created. Issues with dependency injection with Symfony; it has an extensive amount of cache, so you have to clear the cache and restart the application every time\n:party-patch:Soulpatch:\n- Caitlin reviewed Danny’s PR’s\n- Caitlin finished Ethermaker\n:canvas: LTI 1.3 Conversion:\n- Matt has been working on getting the deploy stuff working. Gave crash course on how deploy to AWS and all the insane mazes you have to go through\n- The dev version of Syntax highlighter has been deployed onto AWS\n:ucfhere: UCF Here :ucfhere::\n- Colby made a graph to illustrate how tardy absences change over time and is working on front-end unit testing\n- Met with LTI team to get the AWS rundown\n- Setup direct URL to UCF Privacy Policy\n- APK built on the Galaxy S23\n- Need to make sure it stays in the play store\n:jack_o_lantern:THE PUMPKIN: Reddit is killing third-party apps. What’s a good replacement?\n- Jacob - Dig, Bluesky, Bludit, creating websites pro-bono for small businesses\n- Danny m - Quora\n- Corey - Not Discord\n- Zander - Discord forums is unintuitive."
}